-- 아래 1과 2 둘 중 한 가지 선택.
-- 1. mysql 접속, foodo db 선택(use foodo) 후,
-- source ./testData.sql;
-- 2. 프로젝트 루트 폴더 터미널에서,
-- mysql -u root -p foodo < ./testData.sql
-- test user 비밀번호는 모두 12341234 입니다.

INSERT INTO USERS (email, password, userName, createdAt, updatedAt) 
VALUES ('111@test.com','7dcf0061d18f8497ca853149a33f3cb9cf14adb05f02336c35e2c2b0ffc34760226adf2291ec3289a46bf1849736bf9ce3681cc6a6aaad1d0de4afb99faf7724','user01', '2019-11-03', '2019-11-03'),
 ('222@test.com','7dcf0061d18f8497ca853149a33f3cb9cf14adb05f02336c35e2c2b0ffc34760226adf2291ec3289a46bf1849736bf9ce3681cc6a6aaad1d0de4afb99faf7724','user02', '2019-11-03', '2019-11-03'),
 ('333@test.com','7dcf0061d18f8497ca853149a33f3cb9cf14adb05f02336c35e2c2b0ffc34760226adf2291ec3289a46bf1849736bf9ce3681cc6a6aaad1d0de4afb99faf7724','user03', '2019-11-03', '2019-11-03');

INSERT INTO INGREDIENTS (ing_name, category, main, createdAt, updatedAt) 
VALUES 
('갈치','수산물',true, '2019-11-03', '2019-11-03'),         --1
('국수','가공식품반찬류',false, '2019-11-03', '2019-11-03'),  --2
('계란','기타',true, '2019-11-03', '2019-11-03'),          --3
('돼지고기','육류',true, '2019-11-03', '2019-11-03'),       --4
('양배추','채소',false, '2019-11-03', '2019-11-03'),       --5
('오렌지','과일',false, '2019-11-03', '2019-11-03'),       --6
('우유','기타',false, '2019-11-03', '2019-11-03'),        --7
('참기름','조미향신료',false, '2019-11-03', '2019-11-03'),  --8
('닭고기','육류',true, '2019-11-03', '2019-11-03'),       --9
('마늘','채소',false, '2019-11-03', '2019-11-03');       --10

INSERT INTO MENUS (menu_name, menu_ing, ingredientId, createdAt, updatedAt) 
VALUES 
('갈치조림', '설탕, 참깨,가지,고추,당근,마늘,양파,파,들기름,참기름,간장,고춧가루,소금', 1, '2019-11-03', '2019-11-03'),
('제육볶음', '물엿, 설탕, 참깨, 마늘, 생강, 양파, 파, 돼지고기, 들기름, 참기름, 콩기름, 간장, 고추장, 고춧가루, 맛술, 조미료, 후추', 4, '2019-11-03', '2019-11-03'),
('달걀말이', '당근, 시금치, 양파, 파, 표고버섯, 달걀, 새우젓, 콩기름, 소금, 후추', 3, '2019-11-03', '2019-11-03');

INSERT INTO USER_INGS 
(exp, quantity, memo, frozen, unit, deleted, entryQ, userId, ingredientId, count, createdAt, updatedAt) 
VALUES 
('2019-11-10', 1, "memo", false, 'pcs', 0, 5, 2, 1, 2,'2019-11-03', '2019-11-03'),
('2019-11-01', 0, "memo", true, 'pcs', 2, 12, 3, 3, 3, '2019-11-03', '2019-11-03'),

('2019-10-10', 0, "memo 돼지고기", true, 'pcs', 1, 3, 1, 4, 4, '2019-10-07', '2019-11-03'), --
('2019-11-20', 0, "memo 참기름", false, 'pcs', 1, 3, 1, 8, 3, '2019-10-08', '2019-11-03'),
('2019-11-20', 0, "memo 계란", false, 'pcs', 1, 3, 1, 3, 2, '2019-10-09', '2019-11-03'),
('2019-11-20', 0, "memo 계란", false, 'pcs', 2, 3, 1, 3, 0, '2019-10-10', '2019-11-03'), --
('2019-11-20', 1, "memo 국수", false, 'pcs', 0, 1, 1, 2, 2, '2019-10-11', '2019-11-03'),

('2019-11-20', 0, "memo 오렌지", false, 'pcs', 1, 3, 1, 6, 3, '2019-10-13', '2019-11-03'),
('2019-11-20', 0, "memo 계란", false, 'pcs', 2, 3, 1, 3, 0, '2019-10-15', '2019-11-03'),
('2019-11-20', 0, "memo 우유", false, 'pcs', 1, 1, 1, 3, 1, '2019-10-16', '2019-11-03'),--
('2019-11-20', 0, "memo 돼지고기", true, 'pcs', 1, 3, 1, 3, 2, '2019-10-18', '2019-11-03'),--
('2019-11-20', 0, "memo 오렌지", false, 'pcs', 1, 3, 1, 6, 3, '2019-10-19', '2019-11-03'),

('2019-11-20', 0, "memo 양배추", false, 'pcs', 2, 6, 1, 5, 4, '2019-10-20', '2019-11-03'),
('2019-11-20', 1, "memo 돼지고기", true, 'pcs', 0, 3, 1, 4, 2, '2019-10-21', '2019-11-03'),--
('2019-11-20', 0, "memo 계란", false, 'pcs', 2, 3, 1, 3, 0, '2019-10-22', '2019-11-03'), --
('2019-11-20', 2, "memo 닭고기", false, 'pcs', 0, 3, 1, 9, 1, '2019-10-23', '2019-11-03'),
('2019-11-20', 0, "memo 마늘", true, 'pcs', 2, 20, 1, 10, 7, '2019-10-25', '2019-11-03'),

('2019-11-20', 5, "memo 오렌지", false, 'pcs', 0, 10, 1, 6, 3, '2019-10-26', '2019-11-03'),
('2019-11-20', 2, "memo 갈치", false, 'pcs', 0, 3, 1, 1, 1, '2019-10-27', '2019-11-03'),
('2019-11-20', 2, "memo 닭고기", false, 'pcs', 0, 3, 1, 9, 1, '2019-10-28', '2019-11-03'),
('2019-11-20', 3, "memo 마늘", true, 'pcs', 0, 20, 1, 10, 7, '2019-10-29', '2019-11-03'),
('2019-11-20', 0, "memo 우유", true, 'pcs', 1, 1, 1, 7, 3, '2019-10-30', '2019-10-30'),

('2019-11-20', 2, "memo 닭고기", false, 'pcs', 0, 3, 1, 9, 1, '2019-11-25', '2019-11-03'),
('2019-11-20', 0, "memo 양배추", false, 'pcs', 1, 6, 1, 5, 4, '2019-11-04', '2019-11-03'),
('2019-11-20', 1, "memo 참기름", true, 'g', 0, 3, 1, 8, 0, '2019-11-05', '2019-11-03');


